FemDesign.Calculate.Analysis
fdscript.xsd
ANALYSIS

FemDesign.Calculate.Analysis.#ctor
Parameterless constructor for serialization.

FemDesign.Calculate.Analysis.StaticAnalysis(FemDesign.Calculate.Comb,System.Boolean,System.Boolean)
Define a Static Analysis.
comb:
calcCase:
calccomb:
Returns:

FemDesign.Calculate.Analysis.ConstructionStages(System.Boolean)
ghost:
Returns:
Throws System.Exception:

FemDesign.Calculate.Analysis.SetLoadCombinationCalculationParameters(FemDesign.Model)
Internal method to transfer load combination calculation parameters from LoadCombination to Analysis.
model: